<?xml version="1.0" ?>
<net name="paddle-onnx" version="11">
	<layers>
		<layer id="1" name="image" type="Parameter" version="opset1">
			<data shape="?,3,192,192" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="image"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="scale_factor" type="Parameter" version="opset1">
			<data shape="1,2" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="scale_factor"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="scale_factor">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_23275" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="0" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="auto_145_" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="4" size="12"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="auto_145_"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="auto_145_">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="tmp_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="tmp_2">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="auto_147_" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 1, 1" offset="16" size="12"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="auto_147_"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="auto_147_">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="tmp_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="tmp_3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="tmp_3">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Multiply_21794" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="28" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Multiply_20979" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_0.b_0, batch_norm2d_0.w_0, batch_norm2d_0.w_1, batch_norm2d_0.w_2, batch_norm_0.tmp_2, conv2d_100.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_20984" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1756" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="batch_norm_0.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_0.b_0, batch_norm2d_0.w_0, batch_norm2d_0.w_1, batch_norm2d_0.w_2, batch_norm_0.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_0.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="HSwish_9058" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_1, Clip_0, Maximum_459, Mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Multiply_21809" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="1820" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Multiply_20989" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_1.b_0, batch_norm2d_1.w_0, batch_norm2d_1.w_1, batch_norm2d_1.w_2, batch_norm_1.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_0.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_20994" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="2396" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="batch_norm_1.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_1.b_0, batch_norm2d_1.w_0, batch_norm2d_1.w_1, batch_norm2d_1.w_2, batch_norm_1.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_1.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="HSwish_9062" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_2, Clip_1, Maximum_544, Mul_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_21823" type="Const" version="opset1">
			<data element_type="f32" shape="24, 16, 1, 1" offset="2460" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_20999" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_2, Clip_1, Constant_4, Maximum_544, Mul_2, batch_norm2d_2.b_0, batch_norm2d_2.w_0, batch_norm2d_2.w_1, batch_norm2d_2.w_2, batch_norm_2.tmp_2, conv2d_101.tmp_0, conv2d_2.w_0, hardswish_44.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_21004" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="3996" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="batch_norm_2.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_2.b_0, batch_norm2d_2.w_0, batch_norm2d_2.w_1, batch_norm2d_2.w_2, batch_norm_2.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_2.tmp_2">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="HSwish_9066" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_3, Clip_2, Maximum_556, Mul_3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Multiply_21838" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="4092" size="864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Multiply_21009" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_3.b_0, batch_norm2d_3.w_0, batch_norm2d_3.w_1, batch_norm2d_3.w_2, batch_norm_3.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>96</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_1.tmp_0">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_21014" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="4956" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="batch_norm_3.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_3.b_0, batch_norm2d_3.w_0, batch_norm2d_3.w_1, batch_norm2d_3.w_2, batch_norm_3.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_3.tmp_2">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="HSwish_9070" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_4, Clip_3, Maximum_641, Mul_4"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Multiply_21852" type="Const" version="opset1">
			<data element_type="f32" shape="48, 24, 1, 1" offset="5052" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Multiply_21019" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_4, Clip_3, Constant_12, Maximum_641, Mul_4, batch_norm2d_4.b_0, batch_norm2d_4.w_0, batch_norm2d_4.w_1, batch_norm2d_4.w_2, batch_norm_4.tmp_2, conv2d_102.tmp_0, conv2d_4.w_0, hardswish_46.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>24</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_21024" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="9660" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="batch_norm_4.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_4.b_0, batch_norm2d_4.w_0, batch_norm2d_4.w_1, batch_norm2d_4.w_2, batch_norm_4.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_4.tmp_2">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="HSwish_9074" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_5, Clip_4, Maximum_653, Mul_5"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Multiply_21867" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 3, 3" offset="9852" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Multiply_21029" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_5.b_0, batch_norm2d_5.w_0, batch_norm2d_5.w_1, batch_norm2d_5.w_2, batch_norm_5.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_2.tmp_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_21034" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="11580" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="batch_norm_5.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_5.b_0, batch_norm2d_5.w_0, batch_norm2d_5.w_1, batch_norm2d_5.w_2, batch_norm_5.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_5.tmp_2">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="HSwish_9078" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_6, Clip_5, Maximum_738, Mul_6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Multiply_21881" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 1, 1" offset="11772" size="9216"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Multiply_21039" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_6, Clip_5, Constant_20, Maximum_738, Mul_6, batch_norm2d_6.b_0, batch_norm2d_6.w_0, batch_norm2d_6.w_1, batch_norm2d_6.w_2, batch_norm_6.tmp_2, conv2d_103.tmp_0, conv2d_6.w_0, hardswish_48.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_21044" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="20988" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="batch_norm_6.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_6.b_0, batch_norm2d_6.w_0, batch_norm2d_6.w_1, batch_norm2d_6.w_2, batch_norm_6.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_6.tmp_2">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="HSwish_9082" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_7, Clip_6, Maximum_750, Mul_7"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Multiply_21896" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 3, 3" offset="21180" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Multiply_21049" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_7.b_0, batch_norm2d_7.w_0, batch_norm2d_7.w_1, batch_norm2d_7.w_2, batch_norm_7.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>48</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_3.tmp_0">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_21054" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="22908" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="batch_norm_7.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_7.b_0, batch_norm2d_7.w_0, batch_norm2d_7.w_1, batch_norm2d_7.w_2, batch_norm_7.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_7.tmp_2">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="HSwish_9086" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_8, Clip_7, Maximum_835, Mul_8"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Multiply_21910" type="Const" version="opset1">
			<data element_type="f32" shape="96, 48, 1, 1" offset="23100" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Multiply_21059" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_8, Clip_7, Constant_28, Maximum_835, Mul_8, batch_norm2d_8.b_0, batch_norm2d_8.w_0, batch_norm2d_8.w_1, batch_norm2d_8.w_2, batch_norm_8.tmp_2, conv2d_104.tmp_0, conv2d_8.w_0, hardswish_50.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>48</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_21064" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="41532" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="batch_norm_8.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_8.b_0, batch_norm2d_8.w_0, batch_norm2d_8.w_1, batch_norm2d_8.w_2, batch_norm_8.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_8.tmp_2">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="HSwish_9090" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_9, Clip_8, Maximum_847, Mul_9"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Multiply_21925" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="41916" size="3456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Multiply_21069" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_9.b_0, batch_norm2d_9.w_0, batch_norm2d_9.w_1, batch_norm2d_9.w_2, batch_norm_9.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_4.tmp_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_21074" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="45372" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="batch_norm_9.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_9.b_0, batch_norm2d_9.w_0, batch_norm2d_9.w_1, batch_norm2d_9.w_2, batch_norm_9.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_9.tmp_2">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="HSwish_9094" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_10, Clip_9, Maximum_932, Mul_10"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Multiply_21939" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 1, 1" offset="45756" size="36864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Multiply_21079" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_10, Clip_9, Constant_36, Maximum_932, Mul_10, batch_norm2d_10.b_0, batch_norm2d_10.w_0, batch_norm2d_10.w_1, batch_norm2d_10.w_2, batch_norm_10.tmp_2, conv2d_10.w_0, conv2d_105.tmp_0, hardswish_52.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_21084" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="82620" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="batch_norm_10.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_10.b_0, batch_norm2d_10.w_0, batch_norm2d_10.w_1, batch_norm2d_10.w_2, batch_norm_10.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_10.tmp_2">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="HSwish_9098" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_11, Clip_10, Maximum_944, Mul_11"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_23252" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="83004" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="hardswish_53.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_11, Clip_10, Constant_40, Maximum_944, Mul_11, hardswish_53.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="hardswish_53.tmp_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Multiply_21948" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="83008" size="3456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Multiply_21089" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_11.b_0, batch_norm2d_11.w_0, batch_norm2d_11.w_1, batch_norm2d_11.w_2, batch_norm_11.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>24</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_5.tmp_0">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_21094" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="86464" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="batch_norm_11.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_11.b_0, batch_norm2d_11.w_0, batch_norm2d_11.w_1, batch_norm2d_11.w_2, batch_norm_11.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_11.tmp_2">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="HSwish_9102" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_12, Clip_11, Maximum_1029, Mul_12"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Multiply_21962" type="Const" version="opset1">
			<data element_type="f32" shape="192, 96, 1, 1" offset="86848" size="73728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Multiply_21099" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_12, Clip_11, Constant_44, Maximum_1029, Mul_12, batch_norm2d_12.b_0, batch_norm2d_12.w_0, batch_norm2d_12.w_1, batch_norm2d_12.w_2, batch_norm_12.tmp_2, conv2d_106.tmp_0, conv2d_12.w_0, hardswish_54.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_21104" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="160576" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="batch_norm_12.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_12.b_0, batch_norm2d_12.w_0, batch_norm2d_12.w_1, batch_norm2d_12.w_2, batch_norm_12.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_12.tmp_2">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="HSwish_9106" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_13, Clip_12, Maximum_1041, Mul_13"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Multiply_21977" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 5, 5" offset="161344" size="19200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Multiply_21109" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_13.b_0, batch_norm2d_13.w_0, batch_norm2d_13.w_1, batch_norm2d_13.w_2, batch_norm_13.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_6.tmp_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_21114" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="180544" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="batch_norm_13.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_13.b_0, batch_norm2d_13.w_0, batch_norm2d_13.w_1, batch_norm2d_13.w_2, batch_norm_13.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_13.tmp_2">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="HSwish_9110" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_14, Clip_13, Maximum_1126, Mul_14"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Multiply_21991" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 1, 1" offset="181312" size="147456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Multiply_21119" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_14, Clip_13, Constant_52, Maximum_1126, Mul_14, batch_norm2d_14.b_0, batch_norm2d_14.w_0, batch_norm2d_14.w_1, batch_norm2d_14.w_2, batch_norm_14.tmp_2, conv2d_107.tmp_0, conv2d_14.w_0, hardswish_56.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_21124" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="328768" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="batch_norm_14.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_14.b_0, batch_norm2d_14.w_0, batch_norm2d_14.w_1, batch_norm2d_14.w_2, batch_norm_14.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_14.tmp_2">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="HSwish_9114" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_15, Clip_14, Maximum_1138, Mul_15"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Multiply_22006" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 5, 5" offset="329536" size="19200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Multiply_21129" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_15.b_0, batch_norm2d_15.w_0, batch_norm2d_15.w_1, batch_norm2d_15.w_2, batch_norm_15.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_7.tmp_0">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_21134" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="348736" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="batch_norm_15.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_15.b_0, batch_norm2d_15.w_0, batch_norm2d_15.w_1, batch_norm2d_15.w_2, batch_norm_15.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_15.tmp_2">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="HSwish_9118" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_16, Clip_15, Maximum_1223, Mul_16"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Multiply_22020" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 1, 1" offset="349504" size="147456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Multiply_21139" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_16, Clip_15, Constant_60, Maximum_1223, Mul_16, batch_norm2d_16.b_0, batch_norm2d_16.w_0, batch_norm2d_16.w_1, batch_norm2d_16.w_2, batch_norm_16.tmp_2, conv2d_108.tmp_0, conv2d_16.w_0, hardswish_58.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_21144" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="496960" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="batch_norm_16.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_16.b_0, batch_norm2d_16.w_0, batch_norm2d_16.w_1, batch_norm2d_16.w_2, batch_norm_16.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_16.tmp_2">
					<dim>-1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="HSwish_9122" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_17, Clip_16, Maximum_1235, Mul_17"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
