<?xml version="1.0" ?>
<net name="paddle-onnx" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,3,320,320" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="image"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Multiply_36130" type="Const" version="opset1">
			<data element_type="f32" shape="16, 3, 3, 3" offset="0" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Multiply_35283" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_0, Conv_0, batch_norm2d_0.b_0, batch_norm2d_0.w_0, batch_norm2d_0.w_1, batch_norm2d_0.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>320</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_35288" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="1728" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="BatchNormalization_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_0, batch_norm2d_0.b_0, batch_norm2d_0.w_0, batch_norm2d_0.w_1, batch_norm2d_0.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_0.tmp_2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="HSwish_23183" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_0, Clip_0, Maximum_452, Mul_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Multiply_36145" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="1792" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Multiply_35293" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_1, batch_norm2d_1.b_0, batch_norm2d_1.w_0, batch_norm2d_1.w_1, batch_norm2d_1.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_0.tmp_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_35298" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="2368" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="BatchNormalization_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_1, batch_norm2d_1.b_0, batch_norm2d_1.w_0, batch_norm2d_1.w_1, batch_norm2d_1.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_1.tmp_2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="HSwish_23187" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_1, Clip_1, Maximum_537, Mul_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Multiply_36159" type="Const" version="opset1">
			<data element_type="f32" shape="24, 16, 1, 1" offset="2432" size="1536"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Multiply_35303" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_1, BatchNormalization_2, Clip_1, Constant_4, Conv_2, Div_1, Maximum_537, Mul_1, batch_norm2d_2.b_0, batch_norm2d_2.w_0, batch_norm2d_2.w_1, batch_norm2d_2.w_2, conv2d_2.w_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_35308" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="3968" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="BatchNormalization_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_2, batch_norm2d_2.b_0, batch_norm2d_2.w_0, batch_norm2d_2.w_1, batch_norm2d_2.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_2.tmp_2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="HSwish_23191" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_2, Clip_2, Maximum_549, Mul_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Multiply_36174" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="4064" size="864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_35313" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_3, batch_norm2d_3.b_0, batch_norm2d_3.w_0, batch_norm2d_3.w_1, batch_norm2d_3.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>160</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_1.tmp_0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_35318" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="4928" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="BatchNormalization_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_3, batch_norm2d_3.b_0, batch_norm2d_3.w_0, batch_norm2d_3.w_1, batch_norm2d_3.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_3.tmp_2">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="HSwish_23195" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_3, Clip_3, Maximum_634, Mul_3"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Multiply_36188" type="Const" version="opset1">
			<data element_type="f32" shape="48, 24, 1, 1" offset="5024" size="4608"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Multiply_35323" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_3, BatchNormalization_4, Clip_3, Constant_12, Conv_4, Div_3, Maximum_634, Mul_3, batch_norm2d_4.b_0, batch_norm2d_4.w_0, batch_norm2d_4.w_1, batch_norm2d_4.w_2, conv2d_4.w_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_35328" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="9632" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="BatchNormalization_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_4, batch_norm2d_4.b_0, batch_norm2d_4.w_0, batch_norm2d_4.w_1, batch_norm2d_4.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_4.tmp_2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="HSwish_23199" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_4, Clip_4, Maximum_646, Mul_4"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Multiply_36203" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 3, 3" offset="9824" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Multiply_35333" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_5, batch_norm2d_5.b_0, batch_norm2d_5.w_0, batch_norm2d_5.w_1, batch_norm2d_5.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_2.tmp_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_35338" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="11552" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="BatchNormalization_5" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_5, batch_norm2d_5.b_0, batch_norm2d_5.w_0, batch_norm2d_5.w_1, batch_norm2d_5.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_5.tmp_2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="HSwish_23203" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_5, Clip_5, Maximum_731, Mul_5"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Multiply_36217" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 1, 1" offset="11744" size="9216"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Multiply_35343" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_5, BatchNormalization_6, Clip_5, Constant_20, Conv_6, Div_5, Maximum_731, Mul_5, batch_norm2d_6.b_0, batch_norm2d_6.w_0, batch_norm2d_6.w_1, batch_norm2d_6.w_2, conv2d_6.w_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_35348" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="20960" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="BatchNormalization_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_6, batch_norm2d_6.b_0, batch_norm2d_6.w_0, batch_norm2d_6.w_1, batch_norm2d_6.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_6.tmp_2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="HSwish_23207" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_6, Clip_6, Maximum_743, Mul_6"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Multiply_36232" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 3, 3" offset="21152" size="1728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Multiply_35353" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_7, batch_norm2d_7.b_0, batch_norm2d_7.w_0, batch_norm2d_7.w_1, batch_norm2d_7.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>80</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_3.tmp_0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_35358" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="22880" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="BatchNormalization_7" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_7, batch_norm2d_7.b_0, batch_norm2d_7.w_0, batch_norm2d_7.w_1, batch_norm2d_7.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_7.tmp_2">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="HSwish_23211" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_7, Clip_7, Maximum_828, Mul_7"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Multiply_36246" type="Const" version="opset1">
			<data element_type="f32" shape="96, 48, 1, 1" offset="23072" size="18432"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Multiply_35363" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_7, BatchNormalization_8, Clip_7, Constant_28, Conv_8, Div_7, Maximum_828, Mul_7, batch_norm2d_8.b_0, batch_norm2d_8.w_0, batch_norm2d_8.w_1, batch_norm2d_8.w_2, conv2d_8.w_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_35368" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="41504" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="BatchNormalization_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_8, batch_norm2d_8.b_0, batch_norm2d_8.w_0, batch_norm2d_8.w_1, batch_norm2d_8.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_8.tmp_2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="HSwish_23215" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_8, Clip_8, Maximum_840, Mul_8"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Multiply_36261" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="41888" size="3456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Multiply_35373" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_9, batch_norm2d_9.b_0, batch_norm2d_9.w_0, batch_norm2d_9.w_1, batch_norm2d_9.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_4.tmp_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_35378" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="45344" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="BatchNormalization_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_9, batch_norm2d_9.b_0, batch_norm2d_9.w_0, batch_norm2d_9.w_1, batch_norm2d_9.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_9.tmp_2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="HSwish_23219" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_9, Clip_9, Maximum_925, Mul_9"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Multiply_36275" type="Const" version="opset1">
			<data element_type="f32" shape="96, 96, 1, 1" offset="45728" size="36864"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Multiply_35383" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_9, BatchNormalization_10, Clip_9, Constant_36, Conv_10, Div_9, Maximum_925, Mul_9, batch_norm2d_10.b_0, batch_norm2d_10.w_0, batch_norm2d_10.w_1, batch_norm2d_10.w_2, conv2d_10.w_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_35388" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="82592" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="BatchNormalization_10" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_10, batch_norm2d_10.b_0, batch_norm2d_10.w_0, batch_norm2d_10.w_1, batch_norm2d_10.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_10.tmp_2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="HSwish_23223" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_10, Clip_10, Maximum_937, Mul_10"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_37653" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="82976" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Div_10" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_10, Clip_10, Constant_40, Div_10, Maximum_937, Mul_10"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="hardswish_53.tmp_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Multiply_36284" type="Const" version="opset1">
			<data element_type="f32" shape="96, 1, 1, 3, 3" offset="82980" size="3456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Multiply_35393" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_11, batch_norm2d_11.b_0, batch_norm2d_11.w_0, batch_norm2d_11.w_1, batch_norm2d_11.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>40</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_5.tmp_0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_35398" type="Const" version="opset1">
			<data element_type="f32" shape="1, 96, 1, 1" offset="86436" size="384"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="BatchNormalization_11" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_11, batch_norm2d_11.b_0, batch_norm2d_11.w_0, batch_norm2d_11.w_1, batch_norm2d_11.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_11.tmp_2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="HSwish_23227" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_11, Clip_11, Maximum_1022, Mul_11"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Multiply_36298" type="Const" version="opset1">
			<data element_type="f32" shape="192, 96, 1, 1" offset="86820" size="73728"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Multiply_35403" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_11, BatchNormalization_12, Clip_11, Constant_44, Conv_12, Div_11, Maximum_1022, Mul_11, batch_norm2d_12.b_0, batch_norm2d_12.w_0, batch_norm2d_12.w_1, batch_norm2d_12.w_2, conv2d_12.w_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_35408" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="160548" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="BatchNormalization_12" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_12, batch_norm2d_12.b_0, batch_norm2d_12.w_0, batch_norm2d_12.w_1, batch_norm2d_12.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_12.tmp_2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="HSwish_23231" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_12, Clip_12, Maximum_1034, Mul_12"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Multiply_36313" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 5, 5" offset="161316" size="19200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Multiply_35413" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_13, batch_norm2d_13.b_0, batch_norm2d_13.w_0, batch_norm2d_13.w_1, batch_norm2d_13.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_6.tmp_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_35418" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="180516" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="BatchNormalization_13" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_13, batch_norm2d_13.b_0, batch_norm2d_13.w_0, batch_norm2d_13.w_1, batch_norm2d_13.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_13.tmp_2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="HSwish_23235" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_13, Clip_13, Maximum_1119, Mul_13"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Multiply_36327" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 1, 1" offset="181284" size="147456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Multiply_35423" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_13, BatchNormalization_14, Clip_13, Constant_52, Conv_14, Div_13, Maximum_1119, Mul_13, batch_norm2d_14.b_0, batch_norm2d_14.w_0, batch_norm2d_14.w_1, batch_norm2d_14.w_2, conv2d_14.w_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_35428" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="328740" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="BatchNormalization_14" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_14, batch_norm2d_14.b_0, batch_norm2d_14.w_0, batch_norm2d_14.w_1, batch_norm2d_14.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_14.tmp_2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="HSwish_23239" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_14, Clip_14, Maximum_1131, Mul_14"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Multiply_36342" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 5, 5" offset="329508" size="19200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Multiply_35433" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_15, batch_norm2d_15.b_0, batch_norm2d_15.w_0, batch_norm2d_15.w_1, batch_norm2d_15.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_7.tmp_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_35438" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="348708" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="BatchNormalization_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_15, batch_norm2d_15.b_0, batch_norm2d_15.w_0, batch_norm2d_15.w_1, batch_norm2d_15.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_15.tmp_2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="HSwish_23243" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_15, Clip_15, Maximum_1216, Mul_15"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Multiply_36356" type="Const" version="opset1">
			<data element_type="f32" shape="192, 192, 1, 1" offset="349476" size="147456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Multiply_35443" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_15, BatchNormalization_16, Clip_15, Constant_60, Conv_16, Div_15, Maximum_1216, Mul_15, batch_norm2d_16.b_0, batch_norm2d_16.w_0, batch_norm2d_16.w_1, batch_norm2d_16.w_2, conv2d_16.w_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_35448" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="496932" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="BatchNormalization_16" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_16, batch_norm2d_16.b_0, batch_norm2d_16.w_0, batch_norm2d_16.w_1, batch_norm2d_16.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_16.tmp_2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="HSwish_23247" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_16, Clip_16, Maximum_1228, Mul_16"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Multiply_36371" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1, 5, 5" offset="497700" size="19200"/>
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Multiply_35453" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="2, 2" pads_end="2, 2" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_17, batch_norm2d_17.b_0, batch_norm2d_17.w_0, batch_norm2d_17.w_1, batch_norm2d_17.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_8.tmp_0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_35458" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1, 1" offset="516900" size="768"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="BatchNormalization_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="BatchNormalization_17, batch_norm2d_17.b_0, batch_norm2d_17.w_0, batch_norm2d_17.w_1, batch_norm2d_17.w_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_17.tmp_2">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="HSwish_23251" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="Add_17, Clip_17, Maximum_1313, Mul_17"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>20</dim>
					<dim>20</dim>
				</port>
			</input>
			<output>
