<?xml version="1.0" ?>
<net name="paddle-onnx" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="?,3,128,96" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="image"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Multiply_56594" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="0" size="3456"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Multiply_54711" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_0.b_0, batch_norm2d_0.w_0, batch_norm2d_0.w_1, batch_norm2d_0.w_2, batch_norm_0.tmp_2, conv2d_269.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_54716" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3456" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="batch_norm_0.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_0.b_0, batch_norm2d_0.w_0, batch_norm2d_0.w_1, batch_norm2d_0.w_2, batch_norm_0.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_0.tmp_2">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="relu_0.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_0.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_0.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_1347" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1347"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="7" name="split_0.tmp_1" type="Split" version="opset1">
			<data num_splits="2"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="split_0.tmp_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="FP32" names="split_0.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
				<port id="3" precision="FP32" names="split_0.tmp_1">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Multiply_56603" type="Const" version="opset1">
			<data element_type="f32" shape="16, 1, 1, 3, 3" offset="3592" size="576"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Multiply_54718" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_1.b_0, batch_norm2d_1.w_0, batch_norm2d_1.w_1, batch_norm2d_1.w_2, batch_norm_1.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_0.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_54723" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="4168" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="batch_norm_1.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_1.b_0, batch_norm2d_1.w_0, batch_norm2d_1.w_1, batch_norm2d_1.w_2, batch_norm_1.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_1.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Multiply_56611" type="Const" version="opset1">
			<data element_type="f32" shape="16, 16, 1, 1" offset="4232" size="1024"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Multiply_54725" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_2.b_0, batch_norm2d_2.w_0, batch_norm2d_2.w_1, batch_norm2d_2.w_2, batch_norm_2.tmp_2, conv2d_270.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_54730" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="5256" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="batch_norm_2.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_2.b_0, batch_norm2d_2.w_0, batch_norm2d_2.w_1, batch_norm2d_2.w_2, batch_norm_2.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_2.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="relu_1.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_1.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_1.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Multiply_56620" type="Const" version="opset1">
			<data element_type="f32" shape="32, 16, 1, 1" offset="5320" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_54732" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_3.b_0, batch_norm2d_3.w_0, batch_norm2d_3.w_1, batch_norm2d_3.w_2, batch_norm_3.tmp_2, conv2d_271.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_54737" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7368" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="batch_norm_3.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_3.b_0, batch_norm2d_3.w_0, batch_norm2d_3.w_1, batch_norm2d_3.w_2, batch_norm_3.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_3.tmp_2">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="relu_2.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_2.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_2.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Multiply_56629" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="7496" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Multiply_54739" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_4.b_0, batch_norm2d_4.w_0, batch_norm2d_4.w_1, batch_norm2d_4.w_2, batch_norm_4.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>48</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_1.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_54744" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="8648" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="batch_norm_4.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_4.b_0, batch_norm2d_4.w_0, batch_norm2d_4.w_1, batch_norm2d_4.w_2, batch_norm_4.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_4.tmp_2">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Multiply_56637" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="8776" size="2048"/>
			<output>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Multiply_54746" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_5.b_0, batch_norm2d_5.w_0, batch_norm2d_5.w_1, batch_norm2d_5.w_2, batch_norm_5.tmp_2, conv2d_272.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_54751" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="10824" size="64"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="batch_norm_5.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_5.b_0, batch_norm2d_5.w_0, batch_norm2d_5.w_1, batch_norm2d_5.w_2, batch_norm_5.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_5.tmp_2">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="relu_3.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_3.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_3.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="concat_0.tmp_0" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="concat_0.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="concat_0.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_0" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10888" size="40"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_0"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="Constant_0">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="reshape2_0.tmp_0" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="reshape2_0.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="reshape2_0.tmp_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_1521" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10928" size="40"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1521"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="transpose_0.tmp_0" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="transpose_0.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>16</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose_0.tmp_0">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="10968" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="Constant_1">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="reshape2_1.tmp_0" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="reshape2_1.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="reshape2_1.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Multiply_56646" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="11000" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Multiply_54753" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_6.b_0, batch_norm2d_6.w_0, batch_norm2d_6.w_1, batch_norm2d_6.w_2, batch_norm_6.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_2.tmp_0">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_54758" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="12152" size="128"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="batch_norm_6.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_6.b_0, batch_norm2d_6.w_0, batch_norm2d_6.w_1, batch_norm2d_6.w_2, batch_norm_6.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_6.tmp_2">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Multiply_56654" type="Const" version="opset1">
			<data element_type="f32" shape="40, 32, 1, 1" offset="12280" size="5120"/>
			<output>
				<port id="0" precision="FP32">
					<dim>40</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Multiply_54760" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_7.b_0, batch_norm2d_7.w_0, batch_norm2d_7.w_1, batch_norm2d_7.w_2, batch_norm_7.tmp_2, conv2d_273.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>40</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_54765" type="Const" version="opset1">
			<data element_type="f32" shape="1, 40, 1, 1" offset="17400" size="160"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="batch_norm_7.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_7.b_0, batch_norm2d_7.w_0, batch_norm2d_7.w_1, batch_norm2d_7.w_2, batch_norm_7.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_7.tmp_2">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="relu_4.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_4.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_4.tmp_0">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Constant_1690" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1690"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="48" name="split_1.tmp_1" type="Split" version="opset1">
			<data num_splits="2"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="split_1.tmp_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="FP32" names="split_1.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="3" precision="FP32" names="split_1.tmp_1">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Multiply_56663" type="Const" version="opset1">
			<data element_type="f32" shape="20, 20, 1, 1" offset="17560" size="1600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Multiply_54767" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_10.b_0, batch_norm2d_10.w_0, batch_norm2d_10.w_1, batch_norm2d_10.w_2, batch_norm_10.tmp_2, conv2d_275.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_54772" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1" offset="19160" size="80"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="batch_norm_10.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_10.b_0, batch_norm2d_10.w_0, batch_norm2d_10.w_1, batch_norm2d_10.w_2, batch_norm_10.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_10.tmp_2">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="relu_6.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_6.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_6.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Multiply_56672" type="Const" version="opset1">
			<data element_type="f32" shape="20, 1, 1, 3, 3" offset="19240" size="720"/>
			<output>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Multiply_54774" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_11.b_0, batch_norm2d_11.w_0, batch_norm2d_11.w_1, batch_norm2d_11.w_2, batch_norm_11.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_4.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_54779" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1" offset="19960" size="80"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="batch_norm_11.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_11.b_0, batch_norm2d_11.w_0, batch_norm2d_11.w_1, batch_norm2d_11.w_2, batch_norm_11.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_11.tmp_2">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Multiply_56680" type="Const" version="opset1">
			<data element_type="f32" shape="20, 20, 1, 1" offset="20040" size="1600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Multiply_54781" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_12.b_0, batch_norm2d_12.w_0, batch_norm2d_12.w_1, batch_norm2d_12.w_2, batch_norm_12.tmp_2, conv2d_276.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_54786" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1" offset="21640" size="80"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="batch_norm_12.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_12.b_0, batch_norm2d_12.w_0, batch_norm2d_12.w_1, batch_norm2d_12.w_2, batch_norm_12.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_12.tmp_2">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="relu_7.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_7.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_7.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="concat_1.tmp_0" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="concat_1.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="concat_1.tmp_0">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="21720" size="40"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_2"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="Constant_2">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="reshape2_2.tmp_0" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="reshape2_2.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="reshape2_2.tmp_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_1784" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10928" size="40"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1784"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="transpose_1.tmp_0" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="transpose_1.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose_1.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="21760" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_3"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="Constant_3">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="reshape2_3.tmp_0" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="reshape2_3.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="reshape2_3.tmp_0">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_1793" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3584" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1793"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="71" name="split_2.tmp_1" type="Split" version="opset1">
			<data num_splits="2"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="split_2.tmp_1"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="FP32" names="split_2.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="3" precision="FP32" names="split_2.tmp_1">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Multiply_56689" type="Const" version="opset1">
			<data element_type="f32" shape="20, 20, 1, 1" offset="21792" size="1600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Multiply_54788" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_13.b_0, batch_norm2d_13.w_0, batch_norm2d_13.w_1, batch_norm2d_13.w_2, batch_norm_13.tmp_2, conv2d_277.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Constant_54793" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1" offset="23392" size="80"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="batch_norm_13.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_13.b_0, batch_norm2d_13.w_0, batch_norm2d_13.w_1, batch_norm2d_13.w_2, batch_norm_13.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_13.tmp_2">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="relu_8.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_8.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_8.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Multiply_56698" type="Const" version="opset1">
			<data element_type="f32" shape="20, 1, 1, 3, 3" offset="23472" size="720"/>
			<output>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Multiply_54795" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_14.b_0, batch_norm2d_14.w_0, batch_norm2d_14.w_1, batch_norm2d_14.w_2, batch_norm_14.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="depthwise_conv2d_5.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_54800" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1" offset="24192" size="80"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="batch_norm_14.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_14.b_0, batch_norm2d_14.w_0, batch_norm2d_14.w_1, batch_norm2d_14.w_2, batch_norm_14.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_14.tmp_2">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Multiply_56706" type="Const" version="opset1">
			<data element_type="f32" shape="20, 20, 1, 1" offset="24272" size="1600"/>
			<output>
				<port id="0" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Multiply_54802" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_15.b_0, batch_norm2d_15.w_0, batch_norm2d_15.w_1, batch_norm2d_15.w_2, batch_norm_15.tmp_2, conv2d_278.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>20</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_54807" type="Const" version="opset1">
			<data element_type="f32" shape="1, 20, 1, 1" offset="25872" size="80"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="batch_norm_15.tmp_2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_15.b_0, batch_norm2d_15.w_0, batch_norm2d_15.w_1, batch_norm2d_15.w_2, batch_norm_15.tmp_2"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>20</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="batch_norm_15.tmp_2">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="relu_9.tmp_0" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="relu_9.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="relu_9.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="concat_2.tmp_0" type="Concat" version="opset1">
			<data axis="1"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="concat_2.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="concat_2.tmp_0">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="21720" size="40"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_4"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="Constant_4">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="reshape2_4.tmp_0" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="reshape2_4.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="reshape2_4.tmp_0">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_1887" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="10928" size="40"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1887"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="transpose_2.tmp_0" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="transpose_2.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2</dim>
					<dim>20</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="transpose_2.tmp_0">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="21760" size="32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_5"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="Constant_5">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="reshape2_5.tmp_0" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="reshape2_5.tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>2</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="reshape2_5.tmp_0">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="tmp_0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="tmp_0">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>32</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Multiply_56715" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="25952" size="1152"/>
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Multiply_54809" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="batch_norm2d_8.b_0, batch_norm2d_8.w_0, batch_norm2d_8.w_1, batch_norm2d_8.w_2, batch_norm_8.tmp_2"/>
